In [1]:
import pandas as pd

In [22]:
data = {
    "nome": ["cleber", "filipe", "marta", "jorgina"],
    "sobrenome": ["furtado", "vieira", "castro", "norma"],
    "idade": [25, 20, 18, 16],
    "peso": [75, 80, 70, 56]
}

In [24]:
data["idade"][0]

25

# Convertendo para um DataFrame

In [25]:
df = pd.DataFrame(data)

In [27]:
df

      nome sobrenome  idade  peso
0   cleber   furtado     25    75
1   filipe    vieira     20    80
2    marta    castro     18    70
3  jorgina     norma     16    56

In [28]:
df["idade"] #Me retorna uma série!

0    25
1    20
2    18
3    16
Name: idade, dtype: int64

In [29]:
df["idade"].iloc[0]

np.int64(25)

In [ ]:
#Então, se eu fizer o iloc no DataFrame, temos também uma série...
#Os índices são os nomes das colunas
df.iloc[0] #O nome da série é o índice acessado

nome          cleber
sobrenome    furtado
idade             25
Name: 0, dtype: object

In [34]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
df.columns

Index(['nome', 'sobrenome', 'idade', 'peso'], dtype='object')

In [32]:
df.dtypes

nome         object
sobrenome    object
idade         int64
peso          int64
dtype: object

In [31]:
df.info() #Método de informações

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
 3   peso       4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [ ]:
df.describe() #Método para descrever estatisticas de colunas numéricas

          idade       peso
count   4.00000   4.000000
mean   19.75000  70.250000
std     3.86221  10.340052
min    16.00000  56.000000
25%    17.50000  66.500000
50%    19.00000  72.500000
75%    21.25000  76.250000
max    25.00000  80.000000

In [35]:
df.head(2) #Mostra as primeiras linhas

     nome sobrenome  idade  peso
0  cleber   furtado     25    75
1  filipe    vieira     20    80

In [36]:
df.tail(2) #Mostra as últimas linhas

      nome sobrenome  idade  peso
2    marta    castro     18    70
3  jorgina     norma     16    56